{
   "name": "Michael", 
    "time_of_upload": "2024-09-11 14:30", 
    "job_position": "software engineer", 
    "text_content": {
        "type_of_document": "cover_letter",
        "job_description": "At Boeing, we innovate and collaborate to make the world a better place. From the seabed to outer space, you can contribute to work that matters with a company where diversity, equity and inclusion are shared values. We’re committed to fostering an environment for every teammate that’s welcoming, respectful and inclusive, with great opportunity for professional growth. Find your future with us. Boeing Vancouver is seeking Software Development Interns to work with the Information Technology team. The internships are based at our office in Richmond, British Columbia and are 4 - 8 months in length, starting in early May 2024. Our Student interns work side-by-side with experienced professionals and are given a unique experience as they learn the ropes and attain newfound competencies. Interns are exposed to on-the-job challenges as they work on hands-on tasks, undergo training, and have the opportunity to work on special projects. If this sounds like an exciting opportunity to you, we encourage you to apply. Position Responsibilities: Designing, developing and testing software code. Working with a team to solve problems that impact the business. Participating in meetings and reviews. Working with a Mentor. Making presentations. This position allows telecommuting. The selected candidate will be required to perform some work onsite in Richmond, BC. Employer will not sponsor applicants for employment visa status. Basic Qualifications (Required Skills/Experience): Must be legally able to work in Canada. Must be eligible to handle US export-controlled data. Individual must not pose a risk for safeguarding of controlled goods. Must be enrolled as a full-time student with an accredited university or college. Must have advanced ability in the use of Microsoft Office which includes Access, Excel, Word and PowerPoint. Preferred Qualifications (Desired Skills/Experience): Related work/internship experience is considered an asset. Software development experience. Experience in Java development. Experience working with Python. Graduates are ineligible unless continuing in post-graduate studies. Relocation: Relocation assistance is not a negotiable benefit for this position. Candidates must live in the immediate area or relocate at their own expense. Starting salary will be based on year of post-secondary education completed, qualifications and experience. The range for this internship is $21.00 - $23.50 hourly. This requisition is for a locally hired position in Canada. The employer is Boeing Canada. Candidates must be legally authorized to work in Canada. Benefits and pay are determined by Canada and are not on Boeing US-based payroll. This is not an expatriate assignment.",
        "cover_letter": "Dear Boeing Hiring Manager, As a business & computer science UBC student with an enthusiastic passion for programming and experience writing software in various programming languages such as Java, I look forward to coding for Boeing. I understand that Boeing values engineering excellence and a strong engineering foundation, which allows the company to create safe and high-quality products. Likewise, I believe I will strengthen Boeing’s software engineering team due to my prior programming experience. For example, in my Computer Science 210 course on software construction, I learned to develop applications in Java and do efficient research (using Stack Overflow and other programming sites) to debug code and learn new coding principles on the fly. Using these skills, by the end of the semester, I had developed a working workout tracker which allows users to log exercise sets and determine their strength records (PRs), and I got an A+ in the course. Using the Java programming skills I acquired in Computer Science 210, I will be able to effectively develop and test code for Boeing. Furthermore, as I expect to be learning new coding principles (and possibly languages) on the job as well, my knowledge of using Stack Overflow and researching online to learn coding on my own and efficiently solve programming problems will allow me to quickly adapt to the job’s responsibilities. My prior work experience also demonstrates my abilities to be accountable from beginning to end, as well as respect others and advance a global, diverse team. As a UBC Camps instructor, I collaborated with two other instructors to plan and lead two weeks of coding and biking spring break camps for children of ages 5-12. This involved planning lessons and games together, taking responsibility for leading one’s own activities, and helping each other during unplanned circumstances. By working effectively with my colleagues, we successfully led the spring break camps, responded well to unexpected situations (e.g. injuries while biking), and ultimately provided the children with positive experiences. Likewise, at Boeing, I will demonstrate accountability and respect when working with others in a team, effectively solving problems which benefit the business. Thank you for considering my application, and I look forward to speaking with you further about the job in an interview."
    }
}